---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Index
source: html/067e75f2-193d-f347-94ca-601173767605.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Index Property

return the index of this connector

## Syntax (C#)
```csharp
public int Index { get; }
```